vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7129.inc
; ===============================================                    											
;   ADuC7129 HEADER FILE REV 1.2                            														
;   REV 1.1- Updated DAC Registers														
;   REV 0.7- Removed ID register        											
;               -  Renamed REF0CON to REFCON											
;               -  Renamed ADCCHNP to ADCCP											
;               -  Renamed ADCCHNN to ADCCN											
;               -  Renamed UART0 and UART1 registers
;               -  Added I2C0ADR2 and I2C1ADR2 
;               -  Removed I2C0DIVL I2C0DIVH I2C1DIVL I2C1DIVH
;               -  Removed FEE0PAR FEE1PAR
;               -  Corrected QENCLR and QENSET addresses
;   REV 0.6- Comment removals        
;   REV 0.5- Fixed  COM0DIVL COM0DIVH COM1DIVL COM1DIVH I2C0DIVL I2C0DIVH I2C1DIVL & I2C1DIVH        
;   REV 0.4 - Added FEExPAR and corrected FEExSIGN registers         
;   REV 0.3 - General update based on Rev 1.2                        
;             Corrected REF0CON name                                 
;             Removed GP2PAR                                         
;             Added GP4CLR GP4PAR I2C0CCNT I2C0FSTA I2C1CCNT I2C1FSTA
;             Corrected ADCCHNP ADCCHNN names            
;             Add interrupt definitions - IAR
;   REV 0.2 - Fixed typos                                            
;   REV 0.1 - Initial                                                
; ===============================================                    											
Z_BASE                         EQU       0xFFFF0000
F_BASE                         EQU       0xFFFFF000
MMR_BASE                       EQU       0xFFFF0000
MMR_BASE_LOW                   EQU       0xFFFF0000
MMR_BASE_HIGH                  EQU       0xFFFFF000

; INTERRUPT CONTROLLER

IRQBASE                        EQU       0xFFFF0000
IRQSTA                         EQU       0xFFFF0000
IRQSIG                         EQU       0xFFFF0004
IRQEN                          EQU       0xFFFF0008
IRQCLR                         EQU       0xFFFF000C
SWICFG                         EQU       0xFFFF0010
FIQSTA                         EQU       0xFFFF0100
FIQSIG                         EQU       0xFFFF0104
FIQEN                          EQU       0xFFFF0108
FIQCLR                         EQU       0xFFFF010C
Z_IRQSTA                       EQU       IRQSTA    -Z_BASE
Z_IRQSIG                       EQU       IRQSIG    -Z_BASE
Z_IRQEN                        EQU       IRQEN     -Z_BASE
Z_IRQCLR                       EQU       IRQCLR    -Z_BASE
Z_SWICFG                       EQU       SWICFG    -Z_BASE
Z_FIQSTA                       EQU       FIQSTA    -Z_BASE
Z_FIQSIG                       EQU       FIQSIG    -Z_BASE
Z_FIQEN                        EQU       FIQEN     -Z_BASE
Z_FIQCLR                       EQU       FIQCLR    -Z_BASE

T_IRQSTA                       EQU       IRQSTA    -IRQBASE   
T_IRQSIG                       EQU       IRQSIG    -IRQBASE   
T_IRQEN                        EQU       IRQEN     -IRQBASE   
T_IRQCLR                       EQU       IRQCLR    -IRQBASE   
T_SWICFG                       EQU       SWICFG    -IRQBASE   
T_FIQSTA                       EQU       FIQSTA    -IRQBASE   
T_FIQSIG                       EQU       FIQSIG    -IRQBASE   
T_FIQEN                        EQU       FIQEN     -IRQBASE   
T_FIQCLR                       EQU       FIQCLR    -IRQBASE   

IRQSTA_OFFSET                  EQU       0x0000
IRQSIG_OFFSET                  EQU       0x0004
IRQEN_OFFSET                   EQU       0x0008
IRQCLR_OFFSET                  EQU       0x000C
SWICFG_OFFSET                  EQU       0x0010
FIQSTA_OFFSET                  EQU       0x0100
FIQSIG_OFFSET                  EQU       0x0104
FIQEN_OFFSET                   EQU       0x0108
FIQCLR_OFFSET                  EQU       0x010C

; REMAP AND SYSTEM CONTROL

REMAPBASE                      EQU       0xFFFF0200
REMAP                          EQU       0xFFFF0220
RSTSET                         EQU       0xFFFF0230
RSTSTA                         EQU       0xFFFF0230
RSTCLR                         EQU       0xFFFF0234
Z_REMAP                        EQU       REMAP     -Z_BASE
Z_RSTSET                       EQU       RSTSET    -Z_BASE
Z_RSTSTA                       EQU       RSTSTA    -Z_BASE
Z_RSTCLR                       EQU       RSTCLR    -Z_BASE

T_REMAP                        EQU       REMAP     -REMAPBASE 
T_RSTSET                       EQU       RSTSET    -REMAPBASE 
T_RSTSTA                       EQU       RSTSTA    -REMAPBASE 
T_RSTCLR                       EQU       RSTCLR    -REMAPBASE 

REMAP_OFFSET                   EQU       0x0220
RSTSET_OFFSET                  EQU       0x0230
RSTSTA_OFFSET                  EQU       0x0230
RSTCLR_OFFSET                  EQU       0x0234

; TIMER 0

T0BASE                         EQU       0xFFFF0300
T0LD                           EQU       0xFFFF0300
T0VAL0                         EQU       0xFFFF0304
T0VAL1                         EQU       0xFFFF0308
T0CON                          EQU       0xFFFF030C
T0ICLR                         EQU       0xFFFF0310
T0CAP                          EQU       0xFFFF0314
Z_T0LD                         EQU       T0LD      -Z_BASE
Z_T0VAL0                       EQU       T0VAL0    -Z_BASE
Z_T0VAL1                       EQU       T0VAL1    -Z_BASE
Z_T0CON                        EQU       T0CON     -Z_BASE
Z_T0ICLR                       EQU       T0ICLR    -Z_BASE
Z_T0CAP                        EQU       T0CAP     -Z_BASE

T_T0LD                         EQU       T0LD      -T0BASE    
T_T0VAL0                       EQU       T0VAL0    -T0BASE    
T_T0VAL1                       EQU       T0VAL1    -T0BASE    
T_T0CON                        EQU       T0CON     -T0BASE    
T_T0ICLR                       EQU       T0ICLR    -T0BASE    
T_T0CAP                        EQU       T0CAP     -T0BASE    

T0LD_OFFSET                    EQU       0x0300
T0VAL0_OFFSET                  EQU       0x0304
T0VAL1_OFFSET                  EQU       0x0308
T0CON_OFFSET                   EQU       0x030C
T0ICLR_OFFSET                  EQU       0x0310
T0CAP_OFFSET                   EQU       0x0314

; GENERAL PURPOSE TIMER

T1BASE                         EQU       0xFFFF0320
T1LD                           EQU       0xFFFF0320
T1VAL                          EQU       0xFFFF0324
T1CON                          EQU       0xFFFF0328
T1ICLR                         EQU       0xFFFF032C
T1CAP                          EQU       0xFFFF0330
Z_T1LD                         EQU       T1LD      -Z_BASE
Z_T1VAL                        EQU       T1VAL     -Z_BASE
Z_T1CON                        EQU       T1CON     -Z_BASE
Z_T1ICLR                       EQU       T1ICLR    -Z_BASE
Z_T1CAP                        EQU       T1CAP     -Z_BASE

T_T1LD                         EQU       T1LD      -T1BASE    
T_T1VAL                        EQU       T1VAL     -T1BASE    
T_T1CON                        EQU       T1CON     -T1BASE    
T_T1ICLR                       EQU       T1ICLR    -T1BASE    
T_T1CAP                        EQU       T1CAP     -T1BASE    

T1LD_OFFSET                    EQU       0x0320
T1VAL_OFFSET                   EQU       0x0324
T1CON_OFFSET                   EQU       0x0328
T1ICLR_OFFSET                  EQU       0x032C
T1CAP_OFFSET                   EQU       0x0330

; WAKE UP TIMER

T2BASE                         EQU       0xFFFF0340
T2LD                           EQU       0xFFFF0340
T2VAL                          EQU       0xFFFF0344
T2CON                          EQU       0xFFFF0348
T2ICLR                         EQU       0xFFFF034C
Z_T2LD                         EQU       T2LD      -Z_BASE
Z_T2VAL                        EQU       T2VAL     -Z_BASE
Z_T2CON                        EQU       T2CON     -Z_BASE
Z_T2ICLR                       EQU       T2ICLR    -Z_BASE

T_T2LD                         EQU       T2LD      -T2BASE    
T_T2VAL                        EQU       T2VAL     -T2BASE    
T_T2CON                        EQU       T2CON     -T2BASE    
T_T2ICLR                       EQU       T2ICLR    -T2BASE    

T2LD_OFFSET                    EQU       0x0340
T2VAL_OFFSET                   EQU       0x0344
T2CON_OFFSET                   EQU       0x0348
T2ICLR_OFFSET                  EQU       0x034C

; WATCHDOG TIMER

T3BASE                         EQU       0xFFFF0360
T3LD                           EQU       0xFFFF0360
T3VAL                          EQU       0xFFFF0364
T3CON                          EQU       0xFFFF0368
T3ICLR                         EQU       0xFFFF036C
Z_T3LD                         EQU       T3LD      -Z_BASE
Z_T3VAL                        EQU       T3VAL     -Z_BASE
Z_T3CON                        EQU       T3CON     -Z_BASE
Z_T3ICLR                       EQU       T3ICLR    -Z_BASE

