vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7129.inc
T_DACCON                       EQU       DACCON    -DACBASE   
T_DACDAT                       EQU       DACDAT    -DACBASE   

DACCON_OFFSET                  EQU       0x0670
DACDAT_OFFSET                  EQU       0x06B4

; DDS INTERFACE REGISTERS

DDSBASE                        EQU       0xFFFF0690
DDSCON                         EQU       0xFFFF0690
DDSFRQ                         EQU       0xFFFF0694
DDSPHS                         EQU       0xFFFF0698
DACKEY0                        EQU       0xFFFF06A4
DACEN                          EQU       0xFFFF06B8
DACKEY1                        EQU       0xFFFF06BC
Z_DDSCON                       EQU       DDSCON    -Z_BASE
Z_DDSFRQ                       EQU       DDSFRQ    -Z_BASE
Z_DDSPHS                       EQU       DDSPHS    -Z_BASE
Z_DACKEY0                      EQU       DACKEY0   -Z_BASE
Z_DACEN                        EQU       DACEN     -Z_BASE
Z_DACKEY1                      EQU       DACKEY1   -Z_BASE

T_DDSCON                       EQU       DDSCON    -DDSBASE   
T_DDSFRQ                       EQU       DDSFRQ    -DDSBASE   
T_DDSPHS                       EQU       DDSPHS    -DDSBASE   
T_DACKEY0                      EQU       DACKEY0   -DDSBASE   
T_DACEN                        EQU       DACEN     -DDSBASE   
T_DACKEY1                      EQU       DACKEY1   -DDSBASE   

DDSCON_OFFSET                  EQU       0x0690
DDSFRQ_OFFSET                  EQU       0x0694
DDSPHS_OFFSET                  EQU       0x0698
DACKEY0_OFFSET                 EQU       0x06A4
DACEN_OFFSET                   EQU       0x06B8
DACKEY1_OFFSET                 EQU       0x06BC

; 450 COMPATIABLE UART 0 CORE REGISTERS

UART0BASE                      EQU       0xFFFF0700
COM0TX                         EQU       0xFFFF0700
COM0RX                         EQU       0xFFFF0700
COM0DIV0                       EQU       0xFFFF0700
COM0IEN0                       EQU       0xFFFF0704
COM0DIV1                       EQU       0xFFFF0704
COM0IID0                       EQU       0xFFFF0708
COM0CON0                       EQU       0xFFFF070C
COM0CON1                       EQU       0xFFFF0710
COM0STA0                       EQU       0xFFFF0714
COM0STA1                       EQU       0xFFFF0718
COM0SCR                        EQU       0xFFFF071C
COM0IEN1                       EQU       0xFFFF0720
COM0IID1                       EQU       0xFFFF0724
COM0ADR                        EQU       0xFFFF0728
COM0DIV2                       EQU       0xFFFF072C
Z_COM0TX                       EQU       COM0TX    -Z_BASE
Z_COM0RX                       EQU       COM0RX    -Z_BASE
Z_COM0DIV0                     EQU       COM0DIV0  -Z_BASE
Z_COM0IEN0                     EQU       COM0IEN0  -Z_BASE
Z_COM0DIV1                     EQU       COM0DIV1  -Z_BASE
Z_COM0IID0                     EQU       COM0IID0  -Z_BASE
Z_COM0CON0                     EQU       COM0CON0  -Z_BASE
Z_COM0CON1                     EQU       COM0CON1  -Z_BASE
Z_COM0STA0                     EQU       COM0STA0  -Z_BASE
Z_COM0STA1                     EQU       COM0STA1  -Z_BASE
Z_COM0SCR                      EQU       COM0SCR   -Z_BASE
Z_COM0IEN1                     EQU       COM0IEN1  -Z_BASE
Z_COM0IID1                     EQU       COM0IID1  -Z_BASE
Z_COM0ADR                      EQU       COM0ADR   -Z_BASE
Z_COM0DIV2                     EQU       COM0DIV2  -Z_BASE

T_COM0TX                       EQU       COM0TX    -UART0BASE 
T_COM0RX                       EQU       COM0RX    -UART0BASE 
T_COM0DIV0                     EQU       COM0DIV0  -UART0BASE 
T_COM0IEN0                     EQU       COM0IEN0  -UART0BASE 
T_COM0DIV1                     EQU       COM0DIV1  -UART0BASE 
T_COM0IID0                     EQU       COM0IID0  -UART0BASE 
T_COM0CON0                     EQU       COM0CON0  -UART0BASE 
T_COM0CON1                     EQU       COM0CON1  -UART0BASE 
T_COM0STA0                     EQU       COM0STA0  -UART0BASE 
T_COM0STA1                     EQU       COM0STA1  -UART0BASE 
T_COM0SCR                      EQU       COM0SCR   -UART0BASE 
T_COM0IEN1                     EQU       COM0IEN1  -UART0BASE 
T_COM0IID1                     EQU       COM0IID1  -UART0BASE 
T_COM0ADR                      EQU       COM0ADR   -UART0BASE 
T_COM0DIV2                     EQU       COM0DIV2  -UART0BASE 

COM0TX_OFFSET                  EQU       0x0700
COM0RX_OFFSET                  EQU       0x0700
COM0DIV0_OFFSET                EQU       0x0700
COM0IEN0_OFFSET                EQU       0x0704
COM0DIV1_OFFSET                EQU       0x0704
COM0IID0_OFFSET                EQU       0x0708
COM0CON0_OFFSET                EQU       0x070C
COM0CON1_OFFSET                EQU       0x0710
COM0STA0_OFFSET                EQU       0x0714
COM0STA1_OFFSET                EQU       0x0718
COM0SCR_OFFSET                 EQU       0x071C
COM0IEN1_OFFSET                EQU       0x0720
COM0IID1_OFFSET                EQU       0x0724
COM0ADR_OFFSET                 EQU       0x0728
COM0DIV2_OFFSET                EQU       0x072C

; 450 COMPATIABLE UART 1 CORE REGISTERS

UART1BASE                      EQU       0xFFFF0740
COM1TX                         EQU       0xFFFF0740
COM1RX                         EQU       0xFFFF0740
COM1DIV0                       EQU       0xFFFF0740
COM1IEN0                       EQU       0xFFFF0744
COM1DIV1                       EQU       0xFFFF0744
COM1IID0                       EQU       0xFFFF0748
COM1CON0                       EQU       0xFFFF074C
COM1CON1                       EQU       0xFFFF0750
COM1STA0                       EQU       0xFFFF0754
COM1STA1                       EQU       0xFFFF0758
COM1SCR                        EQU       0xFFFF075C
COM1IEN1                       EQU       0xFFFF0760
COM1IID1                       EQU       0xFFFF0764
COM1ADR                        EQU       0xFFFF0768
COM1DIV2                       EQU       0xFFFF076C
Z_COM1TX                       EQU       COM1TX    -Z_BASE
Z_COM1RX                       EQU       COM1RX    -Z_BASE
Z_COM1DIV0                     EQU       COM1DIV0  -Z_BASE
Z_COM1IEN0                     EQU       COM1IEN0  -Z_BASE
Z_COM1DIV1                     EQU       COM1DIV1  -Z_BASE
Z_COM1IID0                     EQU       COM1IID0  -Z_BASE
Z_COM1CON0                     EQU       COM1CON0  -Z_BASE
Z_COM1CON1                     EQU       COM1CON1  -Z_BASE
Z_COM1STA0                     EQU       COM1STA0  -Z_BASE
Z_COM1STA1                     EQU       COM1STA1  -Z_BASE
Z_COM1SCR                      EQU       COM1SCR   -Z_BASE
Z_COM1IEN1                     EQU       COM1IEN1  -Z_BASE
Z_COM1IID1                     EQU       COM1IID1  -Z_BASE
Z_COM1ADR                      EQU       COM1ADR   -Z_BASE
Z_COM1DIV2                     EQU       COM1DIV2  -Z_BASE

T_COM1TX                       EQU       COM1TX    -UART1BASE 
T_COM1RX                       EQU       COM1RX    -UART1BASE 
T_COM1DIV0                     EQU       COM1DIV0  -UART1BASE 
T_COM1IEN0                     EQU       COM1IEN0  -UART1BASE 
T_COM1DIV1                     EQU       COM1DIV1  -UART1BASE 
T_COM1IID0                     EQU       COM1IID0  -UART1BASE 
T_COM1CON0                     EQU       COM1CON0  -UART1BASE 
T_COM1CON1                     EQU       COM1CON1  -UART1BASE 
T_COM1STA0                     EQU       COM1STA0  -UART1BASE 
T_COM1STA1                     EQU       COM1STA1  -UART1BASE 
T_COM1SCR                      EQU       COM1SCR   -UART1BASE 
T_COM1IEN1                     EQU       COM1IEN1  -UART1BASE 
T_COM1IID1                     EQU       COM1IID1  -UART1BASE 
T_COM1ADR                      EQU       COM1ADR   -UART1BASE 
T_COM1DIV2                     EQU       COM1DIV2  -UART1BASE 

