vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7129.inc
EPBASE                         EQU       0xFFFF0C00
XMCFG                          EQU       0xFFFF0C00
XM0CON                         EQU       0xFFFF0C10
XM1CON                         EQU       0xFFFF0C14
XM2CON                         EQU       0xFFFF0C18
XM3CON                         EQU       0xFFFF0C1C
XM0PAR                         EQU       0xFFFF0C20
XM1PAR                         EQU       0xFFFF0C24
XM2PAR                         EQU       0xFFFF0C28
XM3PAR                         EQU       0xFFFF0C2C
Z_XMCFG                        EQU       XMCFG     -Z_BASE
Z_XM0CON                       EQU       XM0CON    -Z_BASE
Z_XM1CON                       EQU       XM1CON    -Z_BASE
Z_XM2CON                       EQU       XM2CON    -Z_BASE
Z_XM3CON                       EQU       XM3CON    -Z_BASE
Z_XM0PAR                       EQU       XM0PAR    -Z_BASE
Z_XM1PAR                       EQU       XM1PAR    -Z_BASE
Z_XM2PAR                       EQU       XM2PAR    -Z_BASE
Z_XM3PAR                       EQU       XM3PAR    -Z_BASE

T_XMCFG                        EQU       XMCFG     -EPBASE    
T_XM0CON                       EQU       XM0CON    -EPBASE    
T_XM1CON                       EQU       XM1CON    -EPBASE    
T_XM2CON                       EQU       XM2CON    -EPBASE    
T_XM3CON                       EQU       XM3CON    -EPBASE    
T_XM0PAR                       EQU       XM0PAR    -EPBASE    
T_XM1PAR                       EQU       XM1PAR    -EPBASE    
T_XM2PAR                       EQU       XM2PAR    -EPBASE    
T_XM3PAR                       EQU       XM3PAR    -EPBASE    

XMCFG_OFFSET                   EQU       0x0C00
XM0CON_OFFSET                  EQU       0x0C10
XM1CON_OFFSET                  EQU       0x0C14
XM2CON_OFFSET                  EQU       0x0C18
XM3CON_OFFSET                  EQU       0x0C1C
XM0PAR_OFFSET                  EQU       0x0C20
XM1PAR_OFFSET                  EQU       0x0C24
XM2PAR_OFFSET                  EQU       0x0C28
XM3PAR_OFFSET                  EQU       0x0C2C

; GPIO AND SERIAL PORT MUX

GPIOBASE                       EQU       0xFFFF0D00
GP0CON                         EQU       0xFFFF0D00
GP1CON                         EQU       0xFFFF0D04
GP2CON                         EQU       0xFFFF0D08
GP3CON                         EQU       0xFFFF0D0C
GP4CON                         EQU       0xFFFF0D10
GP0DAT                         EQU       0xFFFF0D20
GP0SET                         EQU       0xFFFF0D24
GP0CLR                         EQU       0xFFFF0D28
GP0PAR                         EQU       0xFFFF0D2C
GP1DAT                         EQU       0xFFFF0D30
GP1SET                         EQU       0xFFFF0D34
GP1CLR                         EQU       0xFFFF0D38
GP1PAR                         EQU       0xFFFF0D3C
GP2DAT                         EQU       0xFFFF0D40
GP2SET                         EQU       0xFFFF0D44
GP2CLR                         EQU       0xFFFF0D48
GP3DAT                         EQU       0xFFFF0D50
GP3SET                         EQU       0xFFFF0D54
GP3CLR                         EQU       0xFFFF0D58
GP3PAR                         EQU       0xFFFF0D5C
GP4DAT                         EQU       0xFFFF0D60
GP4SET                         EQU       0xFFFF0D64
GP4CLR                         EQU       0xFFFF0D68
GP4PAR                         EQU       0xFFFF0D6C
Z_GP0CON                       EQU       GP0CON    -Z_BASE
Z_GP1CON                       EQU       GP1CON    -Z_BASE
Z_GP2CON                       EQU       GP2CON    -Z_BASE
Z_GP3CON                       EQU       GP3CON    -Z_BASE
Z_GP4CON                       EQU       GP4CON    -Z_BASE
Z_GP0DAT                       EQU       GP0DAT    -Z_BASE
Z_GP0SET                       EQU       GP0SET    -Z_BASE
Z_GP0CLR                       EQU       GP0CLR    -Z_BASE
Z_GP0PAR                       EQU       GP0PAR    -Z_BASE
Z_GP1DAT                       EQU       GP1DAT    -Z_BASE
Z_GP1SET                       EQU       GP1SET    -Z_BASE
Z_GP1CLR                       EQU       GP1CLR    -Z_BASE
Z_GP1PAR                       EQU       GP1PAR    -Z_BASE
Z_GP2DAT                       EQU       GP2DAT    -Z_BASE
Z_GP2SET                       EQU       GP2SET    -Z_BASE
Z_GP2CLR                       EQU       GP2CLR    -Z_BASE
Z_GP3DAT                       EQU       GP3DAT    -Z_BASE
Z_GP3SET                       EQU       GP3SET    -Z_BASE
Z_GP3CLR                       EQU       GP3CLR    -Z_BASE
Z_GP3PAR                       EQU       GP3PAR    -Z_BASE
Z_GP4DAT                       EQU       GP4DAT    -Z_BASE
Z_GP4SET                       EQU       GP4SET    -Z_BASE
Z_GP4CLR                       EQU       GP4CLR    -Z_BASE
Z_GP4PAR                       EQU       GP4PAR    -Z_BASE

T_GP0CON                       EQU       GP0CON    -GPIOBASE  
T_GP1CON                       EQU       GP1CON    -GPIOBASE  
T_GP2CON                       EQU       GP2CON    -GPIOBASE  
T_GP3CON                       EQU       GP3CON    -GPIOBASE  
T_GP4CON                       EQU       GP4CON    -GPIOBASE  
T_GP0DAT                       EQU       GP0DAT    -GPIOBASE  
T_GP0SET                       EQU       GP0SET    -GPIOBASE  
T_GP0CLR                       EQU       GP0CLR    -GPIOBASE  
T_GP0PAR                       EQU       GP0PAR    -GPIOBASE  
T_GP1DAT                       EQU       GP1DAT    -GPIOBASE  
T_GP1SET                       EQU       GP1SET    -GPIOBASE  
T_GP1CLR                       EQU       GP1CLR    -GPIOBASE  
T_GP1PAR                       EQU       GP1PAR    -GPIOBASE  
T_GP2DAT                       EQU       GP2DAT    -GPIOBASE  
T_GP2SET                       EQU       GP2SET    -GPIOBASE  
T_GP2CLR                       EQU       GP2CLR    -GPIOBASE  
T_GP3DAT                       EQU       GP3DAT    -GPIOBASE  
T_GP3SET                       EQU       GP3SET    -GPIOBASE  
T_GP3CLR                       EQU       GP3CLR    -GPIOBASE  
T_GP3PAR                       EQU       GP3PAR    -GPIOBASE  
T_GP4DAT                       EQU       GP4DAT    -GPIOBASE  
T_GP4SET                       EQU       GP4SET    -GPIOBASE  
T_GP4CLR                       EQU       GP4CLR    -GPIOBASE  
T_GP4PAR                       EQU       GP4PAR    -GPIOBASE  

GP0CON_OFFSET                  EQU       0x0D00
GP1CON_OFFSET                  EQU       0x0D04
GP2CON_OFFSET                  EQU       0x0D08
GP3CON_OFFSET                  EQU       0x0D0C
GP4CON_OFFSET                  EQU       0x0D10
GP0DAT_OFFSET                  EQU       0x0D20
GP0SET_OFFSET                  EQU       0x0D24
GP0CLR_OFFSET                  EQU       0x0D28
GP0PAR_OFFSET                  EQU       0x0D2C
GP1DAT_OFFSET                  EQU       0x0D30
GP1SET_OFFSET                  EQU       0x0D34
GP1CLR_OFFSET                  EQU       0x0D38
GP1PAR_OFFSET                  EQU       0x0D3C
GP2DAT_OFFSET                  EQU       0x0D40
GP2SET_OFFSET                  EQU       0x0D44
GP2CLR_OFFSET                  EQU       0x0D48
GP3DAT_OFFSET                  EQU       0x0D50
GP3SET_OFFSET                  EQU       0x0D54
GP3CLR_OFFSET                  EQU       0x0D58
GP3PAR_OFFSET                  EQU       0x0D5C
GP4DAT_OFFSET                  EQU       0x0D60
GP4SET_OFFSET                  EQU       0x0D64
GP4CLR_OFFSET                  EQU       0x0D68
GP4PAR_OFFSET                  EQU       0x0D6C

; FLASH CONTROL INTERFACE 0

FLASH0BASE                     EQU       0xFFFF0E00
FEE0STA                        EQU       0xFFFF0E00
FEE0MOD                        EQU       0xFFFF0E04
FEE0CON                        EQU       0xFFFF0E08
FEE0DAT                        EQU       0xFFFF0E0C
FEE0ADR                        EQU       0xFFFF0E10
FEE0SGN                        EQU       0xFFFF0E18
FEE0PRO                        EQU       0xFFFF0E1C
FEE0HID                        EQU       0xFFFF0E20
Z_FEE0STA                      EQU       FEE0STA   -Z_BASE
Z_FEE0MOD                      EQU       FEE0MOD   -Z_BASE
Z_FEE0CON                      EQU       FEE0CON   -Z_BASE
Z_FEE0DAT                      EQU       FEE0DAT   -Z_BASE
Z_FEE0ADR                      EQU       FEE0ADR   -Z_BASE
Z_FEE0SGN                      EQU       FEE0SGN   -Z_BASE
Z_FEE0PRO                      EQU       FEE0PRO   -Z_BASE
Z_FEE0HID                      EQU       FEE0HID   -Z_BASE

T_FEE0STA                      EQU       FEE0STA   -FLASH0BASE
T_FEE0MOD                      EQU       FEE0MOD   -FLASH0BASE
T_FEE0CON                      EQU       FEE0CON   -FLASH0BASE
T_FEE0DAT                      EQU       FEE0DAT   -FLASH0BASE
T_FEE0ADR                      EQU       FEE0ADR   -FLASH0BASE
T_FEE0SGN                      EQU       FEE0SGN   -FLASH0BASE
T_FEE0PRO                      EQU       FEE0PRO   -FLASH0BASE
T_FEE0HID                      EQU       FEE0HID   -FLASH0BASE

FEE0STA_OFFSET                 EQU       0x0E00
FEE0MOD_OFFSET                 EQU       0x0E04
FEE0CON_OFFSET                 EQU       0x0E08
FEE0DAT_OFFSET                 EQU       0x0E0C
FEE0ADR_OFFSET                 EQU       0x0E10
FEE0SGN_OFFSET                 EQU       0x0E18
FEE0PRO_OFFSET                 EQU       0x0E1C
FEE0HID_OFFSET                 EQU       0x0E20

; FLASH CONTROL INTERFACE 1

FLASH1BASE                     EQU       0xFFFF0E80
FEE1STA                        EQU       0xFFFF0E80
FEE1MOD                        EQU       0xFFFF0E84
FEE1CON                        EQU       0xFFFF0E88
FEE1DAT                        EQU       0xFFFF0E8C
FEE1ADR                        EQU       0xFFFF0E90
FEE1SGN                        EQU       0xFFFF0E98
FEE1PRO                        EQU       0xFFFF0E9C
FEE1HID                        EQU       0xFFFF0EA0
Z_FEE1STA                      EQU       FEE1STA   -Z_BASE
Z_FEE1MOD                      EQU       FEE1MOD   -Z_BASE
Z_FEE1CON                      EQU       FEE1CON   -Z_BASE
Z_FEE1DAT                      EQU       FEE1DAT   -Z_BASE
Z_FEE1ADR                      EQU       FEE1ADR   -Z_BASE
Z_FEE1SGN                      EQU       FEE1SGN   -Z_BASE
Z_FEE1PRO                      EQU       FEE1PRO   -Z_BASE
Z_FEE1HID                      EQU       FEE1HID   -Z_BASE

