vvpai9/LPC1768-Motor-Safety-Interlock/Keil_v4/ARM/INC/ADI/ADuC7129.inc
T_FEE1STA                      EQU       FEE1STA   -FLASH1BASE
T_FEE1MOD                      EQU       FEE1MOD   -FLASH1BASE
T_FEE1CON                      EQU       FEE1CON   -FLASH1BASE
T_FEE1DAT                      EQU       FEE1DAT   -FLASH1BASE
T_FEE1ADR                      EQU       FEE1ADR   -FLASH1BASE
T_FEE1SGN                      EQU       FEE1SGN   -FLASH1BASE
T_FEE1PRO                      EQU       FEE1PRO   -FLASH1BASE
T_FEE1HID                      EQU       FEE1HID   -FLASH1BASE

FEE1STA_OFFSET                 EQU       0x0E80
FEE1MOD_OFFSET                 EQU       0x0E84
FEE1CON_OFFSET                 EQU       0x0E88
FEE1DAT_OFFSET                 EQU       0x0E8C
FEE1ADR_OFFSET                 EQU       0x0E90
FEE1SGN_OFFSET                 EQU       0x0E98
FEE1PRO_OFFSET                 EQU       0x0E9C
FEE1HID_OFFSET                 EQU       0x0EA0

; Quadrature Encoder

QENBASE                        EQU       0xFFFF0F00
QENCON                         EQU       0xFFFF0F00
QENSTA                         EQU       0xFFFF0F04
QENDAT                         EQU       0xFFFF0F08
QENVAL                         EQU       0xFFFF0F0C
QENCLR                         EQU       0xFFFF0F14
QENSET                         EQU       0xFFFF0F18
Z_QENCON                       EQU       QENCON    -Z_BASE
Z_QENSTA                       EQU       QENSTA    -Z_BASE
Z_QENDAT                       EQU       QENDAT    -Z_BASE
Z_QENVAL                       EQU       QENVAL    -Z_BASE
Z_QENCLR                       EQU       QENCLR    -Z_BASE
Z_QENSET                       EQU       QENSET    -Z_BASE

T_QENCON                       EQU       QENCON    -QENBASE   
T_QENSTA                       EQU       QENSTA    -QENBASE   
T_QENDAT                       EQU       QENDAT    -QENBASE   
T_QENVAL                       EQU       QENVAL    -QENBASE   
T_QENCLR                       EQU       QENCLR    -QENBASE   
T_QENSET                       EQU       QENSET    -QENBASE   

QENCON_OFFSET                  EQU       0x0F00
QENSTA_OFFSET                  EQU       0x0F04
QENDAT_OFFSET                  EQU       0x0F08
QENVAL_OFFSET                  EQU       0x0F0C
QENCLR_OFFSET                  EQU       0x0F14
QENSET_OFFSET                  EQU       0x0F18

; Pulse Width Modulator

PWMBASE                        EQU       0xFFFF0F80
PWMCON1                        EQU       0xFFFF0F80
PWM1COM1                       EQU       0xFFFF0F84
PWM1COM2                       EQU       0xFFFF0F88
PWM1COM3                       EQU       0xFFFF0F8C
PWM1LEN                        EQU       0xFFFF0F90
PWM2COM1                       EQU       0xFFFF0F94
PWM2COM2                       EQU       0xFFFF0F98
PWM2COM3                       EQU       0xFFFF0F9C
PWM2LEN                        EQU       0xFFFF0FA0
PWM3COM1                       EQU       0xFFFF0FA4
PWM3COM2                       EQU       0xFFFF0FA8
PWM3COM3                       EQU       0xFFFF0FAC
PWM3LEN                        EQU       0xFFFF0FB0
PWMCON2                        EQU       0xFFFF0FB4
PWMICLR                        EQU       0xFFFF0FB8
Z_PWMCON1                      EQU       PWMCON1   -Z_BASE
Z_PWM1COM1                     EQU       PWM1COM1  -Z_BASE
Z_PWM1COM2                     EQU       PWM1COM2  -Z_BASE
Z_PWM1COM3                     EQU       PWM1COM3  -Z_BASE
Z_PWM1LEN                      EQU       PWM1LEN   -Z_BASE
Z_PWM2COM1                     EQU       PWM2COM1  -Z_BASE
Z_PWM2COM2                     EQU       PWM2COM2  -Z_BASE
Z_PWM2COM3                     EQU       PWM2COM3  -Z_BASE
Z_PWM2LEN                      EQU       PWM2LEN   -Z_BASE
Z_PWM3COM1                     EQU       PWM3COM1  -Z_BASE
Z_PWM3COM2                     EQU       PWM3COM2  -Z_BASE
Z_PWM3COM3                     EQU       PWM3COM3  -Z_BASE
Z_PWM3LEN                      EQU       PWM3LEN   -Z_BASE
Z_PWMCON2                      EQU       PWMCON2   -Z_BASE
Z_PWMICLR                      EQU       PWMICLR   -Z_BASE

T_PWMCON1                      EQU       PWMCON1   -PWMBASE   
T_PWM1COM1                     EQU       PWM1COM1  -PWMBASE   
T_PWM1COM2                     EQU       PWM1COM2  -PWMBASE   
T_PWM1COM3                     EQU       PWM1COM3  -PWMBASE   
T_PWM1LEN                      EQU       PWM1LEN   -PWMBASE   
T_PWM2COM1                     EQU       PWM2COM1  -PWMBASE   
T_PWM2COM2                     EQU       PWM2COM2  -PWMBASE   
T_PWM2COM3                     EQU       PWM2COM3  -PWMBASE   
T_PWM2LEN                      EQU       PWM2LEN   -PWMBASE   
T_PWM3COM1                     EQU       PWM3COM1  -PWMBASE   
T_PWM3COM2                     EQU       PWM3COM2  -PWMBASE   
T_PWM3COM3                     EQU       PWM3COM3  -PWMBASE   
T_PWM3LEN                      EQU       PWM3LEN   -PWMBASE   
T_PWMCON2                      EQU       PWMCON2   -PWMBASE   
T_PWMICLR                      EQU       PWMICLR   -PWMBASE   

PWMCON1_OFFSET                 EQU       0x0F80
PWM1COM1_OFFSET                EQU       0x0F84
PWM1COM2_OFFSET                EQU       0x0F88
PWM1COM3_OFFSET                EQU       0x0F8C
PWM1LEN_OFFSET                 EQU       0x0F90
PWM2COM1_OFFSET                EQU       0x0F94
PWM2COM2_OFFSET                EQU       0x0F98
PWM2COM3_OFFSET                EQU       0x0F9C
PWM2LEN_OFFSET                 EQU       0x0FA0
PWM3COM1_OFFSET                EQU       0x0FA4
PWM3COM2_OFFSET                EQU       0x0FA8
PWM3COM3_OFFSET                EQU       0x0FAC
PWM3LEN_OFFSET                 EQU       0x0FB0
PWMCON2_OFFSET                 EQU       0x0FB4
PWMICLR_OFFSET                 EQU       0x0FB8
